patrickmetzner/betaLogger/betaLogger/Middlewares/Third_Party/FatFs/src/stm32_ff_link.c
#include "stm32_ff_link.h"
#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#define SD_DUMMY_BYTE					0xFF
#define SD_NO_RESPONSE_EXPECTED			0x80
#define SD_PRESENT						((uint8_t)0x01)
#define SD_NOT_PRESENT					((uint8_t)0x00)
#define SD_MAX_TRY						100		// Number of try 
#define SD_CMD_LENGTH					6

#define SD_CMD_GO_IDLE_STATE							0		 // CMD0 = 0x40	
#define SD_CMD_SEND_OP_COND								1		 // CMD1 = 0x41	
#define SD_CMD_SEND_IF_COND								8		 // CMD8 = 0x48	
#define SD_CMD_SEND_CSD									9		 // CMD9 = 0x49	
#define SD_CMD_SEND_CID									10		// CMD10 = 0x4A 
#define SD_CMD_STOP_TRANSMISSION						12		// CMD12 = 0x4C 
#define SD_CMD_SEND_STATUS								13		// CMD13 = 0x4D 
#define SD_CMD_SET_BLOCKLEN								16		// CMD16 = 0x50 
#define SD_CMD_READ_SINGLE_BLOCK						17		// CMD17 = 0x51 
#define SD_CMD_READ_MULT_BLOCK							18		// CMD18 = 0x52 
#define SD_CMD_SET_BLOCK_COUNT							23		// CMD23 = 0x57 
#define SD_CMD_WRITE_SINGLE_BLOCK						24		// CMD24 = 0x58 
#define SD_CMD_WRITE_MULT_BLOCK							25		// CMD25 = 0x59 
#define SD_CMD_PROG_CSD									27		// CMD27 = 0x5B 
#define SD_CMD_SET_WRITE_PROT							28		// CMD28 = 0x5C 
#define SD_CMD_CLR_WRITE_PROT							29		// CMD29 = 0x5D 
#define SD_CMD_SEND_WRITE_PROT							30		// CMD30 = 0x5E 
#define SD_CMD_SD_ERASE_GRP_START						32		// CMD32 = 0x60 
#define SD_CMD_SD_ERASE_GRP_END							33		// CMD33 = 0x61 
#define SD_CMD_UNTAG_SECTOR								34		// CMD34 = 0x62 
#define SD_CMD_ERASE_GRP_START							35		// CMD35 = 0x63 
#define SD_CMD_ERASE_GRP_END							36		// CMD36 = 0x64 
#define SD_CMD_UNTAG_ERASE_GROUP						37		// CMD37 = 0x65 
#define SD_CMD_ERASE									38		// CMD38 = 0x66 
#define SD_CMD_SD_APP_OP_COND							41		// CMD41 = 0x69 
#define SD_CMD_APP_CMD									55		// CMD55 = 0x77 
#define SD_CMD_READ_OCR									58		// CMD55 = 0x79 

#define SD_TOKEN_START_DATA_SINGLE_BLOCK_READ			0xFE	// Data token start byte, Start Single Block Read 
#define SD_TOKEN_START_DATA_MULTIPLE_BLOCK_READ			0xFE	// Data token start byte, Start Multiple Block Read 
#define SD_TOKEN_START_DATA_SINGLE_BLOCK_WRITE			0xFE	// Data token start byte, Start Single Block Write 
#define SD_TOKEN_START_DATA_MULTIPLE_BLOCK_WRITE		0xFD	// Data token start byte, Start Multiple Block Write 
#define SD_TOKEN_STOP_DATA_MULTIPLE_BLOCK_WRITE			0xFD	// Data toke stop byte, Stop Multiple Block Write 

typedef struct {
	uint8_t r1;
	uint8_t r2;
	uint8_t r3;
	uint8_t r4;
	uint8_t r5;
} SD_CmdAnswer_typedef;

typedef enum {
	SD_ANSWER_R1_EXPECTED,
	SD_ANSWER_R1B_EXPECTED,
	SD_ANSWER_R2_EXPECTED,
	SD_ANSWER_R3_EXPECTED,
	SD_ANSWER_R4R5_EXPECTED,
	SD_ANSWER_R7_EXPECTED,
} SD_Answer_type;

typedef enum {
	// R1 answer value
	SD_R1_NO_ERROR						= (0x00),
	SD_R1_IN_IDLE_STATE					= (0x01),
	SD_R1_ERASE_RESET					= (0x02),
	SD_R1_ILLEGAL_COMMAND				= (0x04),
	SD_R1_COM_CRC_ERROR					= (0x08),
	SD_R1_ERASE_SEQUENCE_ERROR			= (0x10),
	SD_R1_ADDRESS_ERROR					= (0x20),
	SD_R1_PARAMETER_ERROR				= (0x40),

	// R2 answer value
	SD_R2_NO_ERROR						= 0x00,
	SD_R2_CARD_LOCKED					= 0x01,
	SD_R2_LOCKUNLOCK_ERROR				= 0x02,
	SD_R2_ERROR							= 0x04,
	SD_R2_CC_ERROR						= 0x08,
	SD_R2_CARD_ECC_FAILED				= 0x10,
	SD_R2_WP_VIOLATION					= 0x20,
	SD_R2_ERASE_PARAM					= 0x40,
	SD_R2_OUTOFRANGE					= 0x80,

	SD_DATA_OK							= (0x05),
	SD_DATA_CRC_ERROR					= (0x0B),
	SD_DATA_WRITE_ERROR					= (0x0D),
	SD_DATA_OTHER_ERROR					= (0xFF)
} SD_Error;


volatile uint8_t SdStatus = SD_NOT_PRESENT;
uint16_t flag_SDHC = 0;

static void SPIx_Init(void);
static void SPIx_GPIO_Init(void);
static void SPIx_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLength);
static void SPIx_WriteData(uint8_t *DataIn, uint16_t DataLength);
static void SPIx_Write(uint8_t Value);
static void SPIx_Error(void);
static void SPIx_FlushFifo(void);

static uint8_t SD_GoIdleState(void);
static SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer);
static uint8_t SD_ReadData(void);
static uint8_t SD_GetDataResponse(void);
static uint8_t SD_GetCIDRegister(SD_CID *Cid);
static uint8_t SD_GetCSDRegister(SD_CSD *Csd);
static uint8_t SD_WaitData(uint8_t data);


static void SPIx_Init(void)
{
	if (HAL_SPI_GetState(&SD_SPI_HANDLE) == HAL_SPI_STATE_RESET) {
		SPIx_GPIO_Init();
		/* SPI Config */
		/* SPI baudrate is set to 12 MHz maximum (PCLK1/SPI_BaudRatePrescaler = 48/4 = 12 MHz)
		 to verify these constraints:
		    - SD card SPI interface max baudrate is 25MHz for write/read
		    - PCLK1 max frequency is 48 MHz
		 */
		SD_SPI_HANDLE.Init.BaudRatePrescaler = SD_SPI_BAUD_RATE;
		SD_SPI_HANDLE.Init.CLKPhase = SPI_PHASE_2EDGE;
		SD_SPI_HANDLE.Init.CLKPolarity = SPI_POLARITY_HIGH;
		SD_SPI_HANDLE.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
// SD_SPI_HANDLE.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
// SD_SPI_HANDLE.Init.CRCPolynomial = 7;
		SD_SPI_HANDLE.Init.DataSize = SPI_DATASIZE_8BIT;
		SD_SPI_HANDLE.Init.Direction = SPI_DIRECTION_2LINES;
		SD_SPI_HANDLE.Init.FirstBit = SPI_FIRSTBIT_MSB;
		SD_SPI_HANDLE.Init.Mode = SPI_MODE_MASTER;
		SD_SPI_HANDLE.Init.NSS = SPI_NSS_SOFT;
// SD_SPI_HANDLE.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
		SD_SPI_HANDLE.Init.TIMode = SPI_TIMODE_DISABLE;
		SD_SPI_HANDLE.Instance = SD_SPI_INSTANCE;

		HAL_SPI_Init(&SD_SPI_HANDLE);
	}
}

static void SPIx_GPIO_Init(void)
{
	GPIO_InitTypeDef gpioinitstruct = {0};

	/*** Configure the GPIOs ***/
	/* Enable GPIO clock */
	SD_SCLK_GPIO_CLK_ENABLE();
	SD_MISO_GPIO_CLK_ENABLE();
	SD_MOSI_GPIO_CLK_ENABLE();
	SD_CS_GPIO_CLK_ENABLE();

	/* Configure SPI SCLK */
	gpioinitstruct.Pin = SD_SCLK_PIN;
	gpioinitstruct.Mode = GPIO_MODE_AF_PP;
// gpioinitstruct.Pull  = GPIO_PULLUP;
	gpioinitstruct.Speed = GPIO_SPEED_FREQ_HIGH;
// gpioinitstruct.Alternate = SD_SCLK_AF;
	HAL_GPIO_Init(SD_SCLK_GPIO_PORT, &gpioinitstruct);

	/* Configure SPI MISO */
	gpioinitstruct.Pin = SD_MISO_PIN;
	gpioinitstruct.Mode = GPIO_MODE_INPUT;
	gpioinitstruct.Pull  = GPIO_NOPULL;
	HAL_GPIO_Init(SD_MISO_GPIO_PORT, &gpioinitstruct);

	/* Configure SPI MOSI */
	gpioinitstruct.Pin = SD_MOSI_PIN;
	gpioinitstruct.Mode = GPIO_MODE_AF_PP;
	gpioinitstruct.Pull  = GPIO_NOPULL;
	HAL_GPIO_Init(SD_MOSI_GPIO_PORT, &gpioinitstruct);

