patrickmetzner/betaLogger/betaLogger/Middlewares/Third_Party/FatFs/src/stm32_ff_link.c
	/*** Configure the SPI peripheral ***/
	/* Enable SPI clock */
	SD_SPI_CLK_ENABLE();
}

static void SPIx_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLength)
{
	HAL_StatusTypeDef status = HAL_OK;

	status = HAL_SPI_TransmitReceive(&SD_SPI_HANDLE, (uint8_t *) DataIn, DataOut, DataLength, SD_SPI_TIMEOUT_MAX);

	/* Check the communication status */
	if (status != HAL_OK) {
		/* Execute user timeout callback */
		SPIx_Error();
	}
}

static void SPIx_WriteData(uint8_t *DataIn, uint16_t DataLength)
{
	HAL_StatusTypeDef status = HAL_OK;

	status = HAL_SPI_Transmit(&SD_SPI_HANDLE, DataIn, DataLength, SD_SPI_TIMEOUT_MAX);

	/* Check the communication status */
	if (status != HAL_OK) {
		/* Execute user timeout callback */
		SPIx_Error();
	}
}

static void SPIx_Write(uint8_t Value)
{
	HAL_StatusTypeDef status = HAL_OK;
	uint8_t data;

	status = HAL_SPI_TransmitReceive(&SD_SPI_HANDLE, (uint8_t *) &Value, &data, 1, SD_SPI_TIMEOUT_MAX);

	/* Check the communication status */
	if (status != HAL_OK) {
		/* Execute user timeout callback */
		SPIx_Error();
	}
}

static void SPIx_Error(void)
{
	/* De-initialize the SPI communication BUS */
	HAL_SPI_DeInit(&SD_SPI_HANDLE);

	/* Re-Initiaize the SPI communication BUS */
	SPIx_Init();
}

static void SPIx_FlushFifo(void)
{
	HAL_SPIEx_FlushRxFifo(&SD_SPI_HANDLE);
}

/********************************* LINK SD ************************************/

void SD_IO_Init(void)
{
	uint8_t counter = 0;

	/*------------Put SD in SPI mode--------------*/
	/* SD SPI Config */
	SPIx_Init();

	/* SD chip select high */
	SD_CS_HIGH();

	/* Send dummy byte 0xFF, 10 times with CS high */
	/* Rise CS and MOSI for 80 clocks cycles */
	for (counter = 0; counter <= 9; counter++) {
		/* Send dummy byte 0xFF */
		SD_IO_WriteByte(SD_DUMMY_BYTE);
	}
}

void SD_IO_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLength)
{
	/* Send the byte */
	SPIx_WriteReadData(DataIn, DataOut, DataLength);
}

uint8_t SD_IO_WriteByte(uint8_t Data)
{
	uint8_t tmp;

	/* Send the byte */
	SPIx_WriteReadData(&Data, &tmp, 1);
	return tmp;
}

void SD_IO_ReadData(uint8_t *DataOut, uint16_t DataLength)
{
	/* Send the byte */
	SD_IO_WriteReadData(DataOut, DataOut, DataLength);
}

void SD_IO_WriteData(const uint8_t *Data, uint16_t DataLength)
{
	/* Send the byte */
	SPIx_WriteData((uint8_t *)Data, DataLength);
	SPIx_FlushFifo();
}

uint8_t BSP_SD_Init(void)
{
	// Configure IO functionalities for SD pin
	SD_IO_Init();

	// SD detection pin is not physically mapped on the Adafruit shield
	SdStatus = SD_PRESENT;

	// SD initialized and set to SPI mode properly
	return SD_GoIdleState();
}

uint8_t BSP_SD_ReadBlocks(uint32_t *pData, uint32_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	uint32_t offset = 0;
	uint8_t retr = BSP_SD_ERROR;
	uint8_t *ptr = NULL;
	SD_CmdAnswer_typedef response;

	// Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
	// Check if the SD acknowledged the set block length command: R1 response (0x00: no errors)
	response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if (response.r1 != SD_R1_NO_ERROR) {
		goto error;
	}

	ptr = malloc(sizeof(uint8_t) * BlockSize);
	if (ptr == NULL) {
		goto error;
	}
	memset(ptr, SD_DUMMY_BYTE, sizeof(uint8_t)*BlockSize);

	// Data transfer
	while (NumberOfBlocks--) {
		// Send CMD17 (SD_CMD_READ_SINGLE_BLOCK) to read one block
		// Check if the SD acknowledged the read block command: R1 response (0x00: no errors)
		response = SD_SendCmd(SD_CMD_READ_SINGLE_BLOCK, (ReadAddr + offset) / (flag_SDHC == 1 ? BlockSize : 1), 0xFF,
							  SD_ANSWER_R1_EXPECTED);
		if (response.r1 != SD_R1_NO_ERROR) {
			goto error;
		}

		// Now look for the data token to signify the start of the data
		if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_SD_OK) {
			// Read the SD block data : read NumByteToRead data
			SD_IO_WriteReadData(ptr, (uint8_t *)pData + offset, BlockSize);

			// Set next read address
			offset += BlockSize;
			// get CRC bytes (not really needed by us, but required by SD)
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			SD_IO_WriteByte(SD_DUMMY_BYTE);
		} else {
			goto error;
		}

		// End the command data read cycle
		SD_CS_HIGH();
		SD_IO_WriteByte(SD_DUMMY_BYTE);
	}

	retr = BSP_SD_OK;

error :
	// Send dummy byte: 8 Clock pulses of delay
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if (ptr != NULL) {
		free(ptr);
	}

	// Return the reponse
	return retr;
}

uint8_t BSP_SD_WriteBlocks(uint32_t *pData, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	uint32_t offset = 0;
	uint8_t retr = BSP_SD_ERROR;
	uint8_t *ptr = NULL;
	SD_CmdAnswer_typedef response;

	// Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
	// Check if the SD acknowledged the set block length command: R1 response (0x00: no errors)
	response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if (response.r1 != SD_R1_NO_ERROR) {
		goto error;
	}

	ptr = malloc(sizeof(uint8_t) * BlockSize);
	if (ptr == NULL) {
		goto error;
	}

	// Data transfer
	while (NumberOfBlocks--) {
		// Send CMD24 (SD_CMD_WRITE_SINGLE_BLOCK) to write blocks	and
		// Check if the SD acknowledged the write block command: R1 response (0x00: no errors)
		response = SD_SendCmd(SD_CMD_WRITE_SINGLE_BLOCK, (WriteAddr + offset) / (flag_SDHC == 1 ? BlockSize : 1), 0xFF,
							  SD_ANSWER_R1_EXPECTED);
		if (response.r1 != SD_R1_NO_ERROR) {
			goto error;
		}

		// Send dummy byte for NWR timing : one byte between CMDWRITE and TOKEN
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		SD_IO_WriteByte(SD_DUMMY_BYTE);

		// Send the data token to signify the start of the data
		SD_IO_WriteByte(SD_TOKEN_START_DATA_SINGLE_BLOCK_WRITE);

		// Write the block data to SD
		SD_IO_WriteReadData((uint8_t *)pData + offset, ptr, BlockSize);

		// Set next write address
		offset += BlockSize;

		// Put CRC bytes (not really needed by us, but required by SD)
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		SD_IO_WriteByte(SD_DUMMY_BYTE);

		// Read data response
		if (SD_GetDataResponse() != SD_DATA_OK) {
			// Set response value to failure
			goto error;
		}

