patrickmetzner/betaLogger/betaLogger/Middlewares/Third_Party/FatFs/src/stm32_ff_link.c
		SD_CS_HIGH();
		SD_IO_WriteByte(SD_DUMMY_BYTE);
	}
	retr = BSP_SD_OK;

error :
	if (ptr != NULL) {
		free(ptr);
	}
	// Send dummy byte: 8 Clock pulses of delay
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	// Return the reponse
	return retr;
}

uint8_t BSP_SD_GetCardInfo(SD_CardInfo *pCardInfo)
{
	uint8_t status;

	status = SD_GetCSDRegister(&(pCardInfo->Csd));
	status |= SD_GetCIDRegister(&(pCardInfo->Cid));
	if (flag_SDHC == 1) {
		pCardInfo->CardBlockSize = 512;
		pCardInfo->CardCapacity = (pCardInfo->Csd.version.v2.DeviceSize + 1) * pCardInfo->CardBlockSize;
	} else {
		pCardInfo->CardCapacity = (pCardInfo->Csd.version.v1.DeviceSize + 1) ;
		pCardInfo->CardCapacity *= (1 << (pCardInfo->Csd.version.v1.DeviceSizeMul + 2));
		pCardInfo->CardBlockSize = 1 << (pCardInfo->Csd.RdBlockLen);
		pCardInfo->CardCapacity *= pCardInfo->CardBlockSize;
	}

	return status;
}

uint8_t BSP_SD_GetStatus(void)
{
	SD_CmdAnswer_typedef retr;

	// Send CMD13 (SD_SEND_STATUS) to get SD status
	retr = SD_SendCmd(SD_CMD_SEND_STATUS, 0, 0xFF, SD_ANSWER_R2_EXPECTED);
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	// Find SD status according to card state
	if ((retr.r1 == SD_R1_NO_ERROR) && (retr.r2 == SD_R2_NO_ERROR)) {
		return BSP_SD_OK;
	}

	return BSP_SD_ERROR;
}

uint8_t BSP_SD_Erase(uint32_t StartAddr, uint32_t EndAddr)
{
	uint8_t retr = BSP_SD_ERROR;
	SD_CmdAnswer_typedef response;

	// Send CMD32 (Erase group start) and check if the SD acknowledged the erase command: R1 response (0x00: no errors)
	response = SD_SendCmd(SD_CMD_SD_ERASE_GRP_START, StartAddr, 0xFF, SD_ANSWER_R1_EXPECTED);
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if (response.r1 == SD_R1_NO_ERROR) {
		// Send CMD33 (Erase group end) and Check if the SD acknowledged the erase command: R1 response (0x00: no errors)
		response = SD_SendCmd(SD_CMD_SD_ERASE_GRP_END, EndAddr, 0xFF, SD_ANSWER_R1_EXPECTED);
		SD_CS_HIGH();
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		if (response.r1 == SD_R1_NO_ERROR) {
			// Send CMD38 (Erase) and Check if the SD acknowledged the erase command: R1 response (0x00: no errors)
			response = SD_SendCmd(SD_CMD_ERASE, 0, 0xFF, SD_ANSWER_R1B_EXPECTED);
			if (response.r1 == SD_R1_NO_ERROR) {
				retr = BSP_SD_OK;
			}
			SD_CS_HIGH();
			SD_IO_WriteByte(SD_DUMMY_BYTE);
		}
	}

	// Return the reponse
	return retr;
}

static uint8_t SD_GoIdleState(void)
{
	SD_CmdAnswer_typedef response;
	volatile uint8_t counter = 0;
	// Send CMD0 (SD_CMD_GO_IDLE_STATE) to put SD in SPI mode and
	// wait for In Idle State Response (R1 Format) equal to 0x01
	do {
		counter++;
		response = SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0, 0x95, SD_ANSWER_R1_EXPECTED);
		SD_CS_HIGH();
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		if (counter >= SD_MAX_TRY) {
			return BSP_SD_ERROR;
		}
	} while (response.r1 != SD_R1_IN_IDLE_STATE);


	// Send CMD8 (SD_CMD_SEND_IF_COND) to check the power supply status
	// and wait until response (R7 Format) equal to 0xAA and
	response = SD_SendCmd(SD_CMD_SEND_IF_COND, 0x1AA, 0x87, SD_ANSWER_R7_EXPECTED);
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if ((response.r1	& SD_R1_ILLEGAL_COMMAND) == SD_R1_ILLEGAL_COMMAND) {
		// initialise card V1
		do {
			// initialise card V1
			// Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors)
			response = SD_SendCmd(SD_CMD_APP_CMD, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);
			SD_CS_HIGH();
			SD_IO_WriteByte(SD_DUMMY_BYTE);

			// Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors)
			response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);
			SD_CS_HIGH();
			SD_IO_WriteByte(SD_DUMMY_BYTE);
		} while (response.r1 == SD_R1_IN_IDLE_STATE);
		flag_SDHC = 0;
	} else if (response.r1 == SD_R1_IN_IDLE_STATE) {
		// initialise card V2
		do {

			// Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors)
			response = SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
			SD_CS_HIGH();
			SD_IO_WriteByte(SD_DUMMY_BYTE);

			// Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors)
			response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x40000000, 0xFF, SD_ANSWER_R1_EXPECTED);
			SD_CS_HIGH();
			SD_IO_WriteByte(SD_DUMMY_BYTE);
		} while (response.r1 == SD_R1_IN_IDLE_STATE);

		if ((response.r1 & SD_R1_ILLEGAL_COMMAND) == SD_R1_ILLEGAL_COMMAND) {
			do {
				// Send CMD55 (SD_CMD_APP_CMD) before any ACMD command: R1 response (0x00: no errors)
				response = SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
				SD_CS_HIGH();
				SD_IO_WriteByte(SD_DUMMY_BYTE);
				if (response.r1 != SD_R1_IN_IDLE_STATE) {
					return BSP_SD_ERROR;
				}
				// Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC or SDXC cards: R1 response (0x00: no errors)
				response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);
				SD_CS_HIGH();
				SD_IO_WriteByte(SD_DUMMY_BYTE);
			} while (response.r1 == SD_R1_IN_IDLE_STATE);
		}

		// Send CMD58 (SD_CMD_READ_OCR) to initialize SDHC or SDXC cards: R3 response (0x00: no errors)
		response = SD_SendCmd(SD_CMD_READ_OCR, 0x00000000, 0xFF, SD_ANSWER_R3_EXPECTED);
		SD_CS_HIGH();
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		if (response.r1 != SD_R1_NO_ERROR) {
			return BSP_SD_ERROR;
		}
		flag_SDHC = (response.r2 & 0x40) >> 6;
	} else {
		return BSP_SD_ERROR;
	}

	return BSP_SD_OK;
}

static SD_CmdAnswer_typedef SD_SendCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Answer)
{
	uint8_t frame[SD_CMD_LENGTH], frameout[SD_CMD_LENGTH];
	SD_CmdAnswer_typedef retr = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

	// R1 Lenght = NCS(0)+ 6 Bytes command + NCR(min1 max8) + 1 Bytes answer + NEC(0) = 15bytes
	// R1b identical to R1 + Busy information
	// R2 Lenght = NCS(0)+ 6 Bytes command + NCR(min1 max8) + 2 Bytes answer + NEC(0) = 16bytes

	// Prepare Frame to send
	frame[0] = (Cmd | 0x40);				 // Construct byte 1
	frame[1] = (uint8_t)(Arg >> 24); // Construct byte 2
	frame[2] = (uint8_t)(Arg >> 16); // Construct byte 3
	frame[3] = (uint8_t)(Arg >> 8);	// Construct byte 4
	frame[4] = (uint8_t)(Arg);			 // Construct byte 5
	frame[5] = (Crc | 0x01);				 // Construct byte 6

	// Send the command
	SD_CS_LOW();
	SD_IO_WriteReadData(frame, frameout, SD_CMD_LENGTH); // Send the Cmd bytes

