patrickmetzner/betaLogger/betaLogger/Middlewares/Third_Party/FatFs/src/stm32_ff_link.c
	switch (Answer) {
	case SD_ANSWER_R1_EXPECTED :
		retr.r1 = SD_ReadData();
		break;
	case SD_ANSWER_R1B_EXPECTED :
		retr.r1 = SD_ReadData();
		retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
		// Set CS High
		SD_CS_HIGH();
		HAL_Delay(1);
		// Set CS Low
		SD_CS_LOW();

		// Wait IO line return 0xFF
		while (SD_IO_WriteByte(SD_DUMMY_BYTE) != 0xFF);
		break;
	case SD_ANSWER_R2_EXPECTED :
		retr.r1 = SD_ReadData();
		retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
		break;
	case SD_ANSWER_R3_EXPECTED :
	case SD_ANSWER_R7_EXPECTED :
		retr.r1 = SD_ReadData();
		retr.r2 = SD_IO_WriteByte(SD_DUMMY_BYTE);
		retr.r3 = SD_IO_WriteByte(SD_DUMMY_BYTE);
		retr.r4 = SD_IO_WriteByte(SD_DUMMY_BYTE);
		retr.r5 = SD_IO_WriteByte(SD_DUMMY_BYTE);
		break;
	default :
		break;
	}
	return retr;
}

static uint8_t SD_ReadData(void)
{
	uint8_t timeout = 0x08;
	uint8_t readvalue;

	// Check if response is got or a timeout is happen
	do {
		readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
		timeout--;

	} while ((readvalue == SD_DUMMY_BYTE) && timeout);

	// Right response got
	return readvalue;
}

static uint8_t SD_GetCSDRegister(SD_CSD *Csd)
{
	uint16_t counter = 0;
	uint8_t CSD_Tab[16];
	uint8_t retr = BSP_SD_ERROR;
	SD_CmdAnswer_typedef response;

	// Send CMD9 (CSD register) or CMD10(CSD register) and Wait for response in the R1 format (0x00 is no errors)
	response = SD_SendCmd(SD_CMD_SEND_CSD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
	if (response.r1 == SD_R1_NO_ERROR) {
		if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_SD_OK) {
			for (counter = 0; counter < 16; counter++) {
				// Store CSD register value on CSD_Tab
				CSD_Tab[counter] = SD_IO_WriteByte(SD_DUMMY_BYTE);
			}

			// Get CRC bytes (not really needed by us, but required by SD)
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			SD_IO_WriteByte(SD_DUMMY_BYTE);

			// CSD header decoding

			// Byte 0
			Csd->CSDStruct = (CSD_Tab[0] & 0xC0) >> 6;
			Csd->Reserved1 =	CSD_Tab[0] & 0x3F;

			// Byte 1
			Csd->TAAC = CSD_Tab[1];

			// Byte 2
			Csd->NSAC = CSD_Tab[2];

			// Byte 3
			Csd->MaxBusClkFrec = CSD_Tab[3];

			// Byte 4/5
			Csd->CardComdClasses = (CSD_Tab[4] << 4) | ((CSD_Tab[5] & 0xF0) >> 4);
			Csd->RdBlockLen = CSD_Tab[5] & 0x0F;

			// Byte 6
			Csd->PartBlockRead	 = (CSD_Tab[6] & 0x80) >> 7;
			Csd->WrBlockMisalign = (CSD_Tab[6] & 0x40) >> 6;
			Csd->RdBlockMisalign = (CSD_Tab[6] & 0x20) >> 5;
			Csd->DSRImpl				 = (CSD_Tab[6] & 0x10) >> 4;

			// CSD v1/v2 decoding

			if (flag_SDHC == 0) {
				Csd->version.v1.Reserved1 = ((CSD_Tab[6] & 0x0C) >> 2);

				Csd->version.v1.DeviceSize =	((CSD_Tab[6] & 0x03) << 10)
												|	(CSD_Tab[7] << 2)
												| ((CSD_Tab[8] & 0xC0) >> 6);
				Csd->version.v1.MaxRdCurrentVDDMin = (CSD_Tab[8] & 0x38) >> 3;
				Csd->version.v1.MaxRdCurrentVDDMax = (CSD_Tab[8] & 0x07);
				Csd->version.v1.MaxWrCurrentVDDMin = (CSD_Tab[9] & 0xE0) >> 5;
				Csd->version.v1.MaxWrCurrentVDDMax = (CSD_Tab[9] & 0x1C) >> 2;
				Csd->version.v1.DeviceSizeMul = ((CSD_Tab[9] & 0x03) << 1)
												| ((CSD_Tab[10] & 0x80) >> 7);
			} else {
				Csd->version.v2.Reserved1 = ((CSD_Tab[6] & 0x0F) << 2) | ((CSD_Tab[7] & 0xC0) >> 6);
				Csd->version.v2.DeviceSize = ((CSD_Tab[7] & 0x3F) << 16) | (CSD_Tab[8] << 8) | CSD_Tab[9];
				Csd->version.v2.Reserved2 = ((CSD_Tab[10] & 0x80) >> 8);
			}

			Csd->EraseSingleBlockEnable = (CSD_Tab[10] & 0x40) >> 6;
			Csd->EraseSectorSize	 = ((CSD_Tab[10] & 0x3F) << 1)
									   | ((CSD_Tab[11] & 0x80) >> 7);
			Csd->WrProtectGrSize	 = (CSD_Tab[11] & 0x7F);
			Csd->WrProtectGrEnable = (CSD_Tab[12] & 0x80) >> 7;
			Csd->Reserved2				 = (CSD_Tab[12] & 0x60) >> 5;
			Csd->WrSpeedFact			 = (CSD_Tab[12] & 0x1C) >> 2;
			Csd->MaxWrBlockLen		 = ((CSD_Tab[12] & 0x03) << 2)
									   | ((CSD_Tab[13] & 0xC0) >> 6);
			Csd->WriteBlockPartial = (CSD_Tab[13] & 0x20) >> 5;
			Csd->Reserved3				 = (CSD_Tab[13] & 0x1F);
			Csd->FileFormatGrouop	= (CSD_Tab[14] & 0x80) >> 7;
			Csd->CopyFlag					= (CSD_Tab[14] & 0x40) >> 6;
			Csd->PermWrProtect		 = (CSD_Tab[14] & 0x20) >> 5;
			Csd->TempWrProtect		 = (CSD_Tab[14] & 0x10) >> 4;
			Csd->FileFormat				= (CSD_Tab[14] & 0x0C) >> 2;
			Csd->Reserved4				 = (CSD_Tab[14] & 0x03);
			Csd->crc							 = (CSD_Tab[15] & 0xFE) >> 1;
			Csd->Reserved5				 = (CSD_Tab[15] & 0x01);

			retr = BSP_SD_OK;
		}
	}

	// Send dummy byte: 8 Clock pulses of delay
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	// Return the reponse
	return retr;
}

static uint8_t SD_GetCIDRegister(SD_CID *Cid)
{
	uint32_t counter = 0;
	uint8_t retr = BSP_SD_ERROR;
	uint8_t CID_Tab[16];
	SD_CmdAnswer_typedef response;

	// Send CMD10 (CID register) and Wait for response in the R1 format (0x00 is no errors)
	response = SD_SendCmd(SD_CMD_SEND_CID, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
	if (response.r1 == SD_R1_NO_ERROR) {
		if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_SD_OK) {
			// Store CID register value on CID_Tab
			for (counter = 0; counter < 16; counter++) {
				CID_Tab[counter] = SD_IO_WriteByte(SD_DUMMY_BYTE);
			}

			// Get CRC bytes (not really needed by us, but required by SD)
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			SD_IO_WriteByte(SD_DUMMY_BYTE);

			// Byte 0
			Cid->ManufacturerID = CID_Tab[0];

			// Byte 1
			Cid->OEM_AppliID = CID_Tab[1] << 8;

			// Byte 2
			Cid->OEM_AppliID |= CID_Tab[2];

			// Byte 3
			Cid->ProdName1 = CID_Tab[3] << 24;

			// Byte 4
			Cid->ProdName1 |= CID_Tab[4] << 16;

			// Byte 5
			Cid->ProdName1 |= CID_Tab[5] << 8;

			// Byte 6
			Cid->ProdName1 |= CID_Tab[6];

			// Byte 7
			Cid->ProdName2 = CID_Tab[7];

			// Byte 8
			Cid->ProdRev = CID_Tab[8];

			// Byte 9
			Cid->ProdSN = CID_Tab[9] << 24;

			// Byte 10
			Cid->ProdSN |= CID_Tab[10] << 16;

			// Byte 11
			Cid->ProdSN |= CID_Tab[11] << 8;

			// Byte 12
			Cid->ProdSN |= CID_Tab[12];

			// Byte 13
			Cid->Reserved1 |= (CID_Tab[13] & 0xF0) >> 4;
			Cid->ManufactDate = (CID_Tab[13] & 0x0F) << 8;

			// Byte 14
			Cid->ManufactDate |= CID_Tab[14];

			// Byte 15
			Cid->CID_CRC = (CID_Tab[15] & 0xFE) >> 1;
			Cid->Reserved2 = 1;

			retr = BSP_SD_OK;
		}
	}

	// Send dummy byte: 8 Clock pulses of delay
	SD_CS_HIGH();
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	// Return the reponse
	return retr;
}

static uint8_t SD_GetDataResponse(void)
{
	uint8_t dataresponse;
	uint8_t rvalue = SD_DATA_OTHER_ERROR;

	dataresponse = SD_IO_WriteByte(SD_DUMMY_BYTE);
	SD_IO_WriteByte(SD_DUMMY_BYTE); // read the busy response byte

	// Mask unused bits
	switch (dataresponse & 0x1F) {
	case SD_DATA_OK:
		rvalue = SD_DATA_OK;

		// Set CS High
		SD_CS_HIGH();
		// Set CS Low
		SD_CS_LOW();

		// Wait IO line return 0xFF
		while (SD_IO_WriteByte(SD_DUMMY_BYTE) != 0xFF);
		break;
	case SD_DATA_CRC_ERROR:
		rvalue =	SD_DATA_CRC_ERROR;
		break;
	case SD_DATA_WRITE_ERROR:
		rvalue = SD_DATA_WRITE_ERROR;
		break;
	default:
		break;
	}

	// Return response
	return rvalue;
}

static uint8_t SD_WaitData(uint8_t data)
{
	uint16_t timeout = 0xFFFF;
	uint8_t readvalue;

	// Check if response is got or a timeout is happen

	do {
		readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
		timeout--;
	} while ((readvalue != data) && timeout);

	if (timeout == 0) {
		// After time out
		return BSP_SD_TIMEOUT;
	}

	// Right response got
	return BSP_SD_OK;
}
